СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/НаправлениеНаПересдачу/НаправлениеНаПересдачу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НаправлениеНаПересдачу</name>
  <basedOn>Document.УведомлениеОНаличииЗадолженности</basedOn>
  <registerRecords>InformationRegister.ГрафикПересдач</registerRecords>
  <registerRecords>CalculationRegister.РасчетНагрузкиПреподавателейПоПересдачам</registerRecords>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаКонтроля</name>
    <type>
      <types>EnumRef.НаименованиеКонтроля</types>
    </type>
  </attributes>
</mdclass:Document>

СистемаЛиквидацииАкадемическихЗадолженностей/src/InformationRegisters/ГрафикПересдач/ГрафикПересдач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикПересдач</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПересдачи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ФормаКонтроля</name>
    <type>
      <types>CatalogRef.ФормаКонтроля</types>
    </type>
  </attributes>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</name>
  <basedOn>Document.НаправлениеНаПересдачу</basedOn>
  <registerRecords>AccumulationRegister.НагрузкаКомиссий</registerRecords>
  <registerRecords>AccumulationRegister.НеявкиНаПересдачи</registerRecords>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныеГода</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>CatalogRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>ПреподавательКомиссии</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </attributes>
  <attributes>
    <name>РольВКомиссии</name>
    <type>
      <types>EnumRef.РольВКомиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗаседаний</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧасыРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.НаправлениеНаПересдачу</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НазначениеСтудентаДляПреподавателя</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеВида</name>
      <type>
        <types>EnumRef.НаименованиеВида</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПропусков</name>
      <type>
        <types>EnumRef.КоличествоПропусков</types>
      </type>
    </attributes>
    <attributes>
      <name>ПотерянныеЧасыПреподавателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/НаправлениеНаПересдачу/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ГрафикПересдач
	Движения.ГрафикПересдач.Записывать = Истина;
	Движение = Движения.ГрафикПересдач.Добавить();
	Движение.Преподаватель = Преподаватель;
	Движение.Аудитория = Аудитория;
	Движение.Дисциплина = Дисциплина;
	Движение.ДатаВыдачи = ДатаВыдачи;
	Движение.ДатаПересдачи = ДатаПересдачи;
	Движение.ФормаКонтроля = ФормаКонтроля;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УведомлениеОНаличииЗадолженности") Тогда
		// Заполнение шапки
		Группа = ДанныеЗаполнения.Группа;
		ДатаВыдачи = ДанныеЗаполнения.ДатаСоставления;
		ДатаПересдачи = ДанныеЗаполнения.СрокЛиквидации;
		Студент = ДанныеЗаполнения.Студент;
		ФормаОбучения = ДанныеЗаполнения.ФормаОбучения;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры



Процедура СоздатьПриказИзНаправлений() Экспорт
    // Создаем новый документ "Приказ"
    НовыйПриказ = Документы.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.СоздатьДокумент();
    
    // Устанавливаем свойства нового приказа
	//НовыйПриказ.Дата = ТекущаяДата(); // Устанавливаем текущую дату
	//НовыйПриказ.Номер = ПолучитьНомерПриказа(); // Или присваиваем номер другим образом
    
    // Получаем выборку документов "Направление на пересдачу"
    ВыборкаНаправлений = Документы.НаправлениеНаПересдачу.Выбрать();
    
    Пока ВыборкаНаправлений.Следующий() Цикл
        Направление = ВыборкаНаправлений.ПолучитьОбъект(); // Получаем текущий документ
        
        // Заполняем поля документа "Приказ" из документа "Направление на пересдачу"
        НовыйЭлементПриказ = НовыйПриказ.Элементы.Добавить(); // Добавляем элемент в приказ
        НовыйЭлементПриказ.Поле1 = Направление.Поле1; // Переносим значение поля1
        НовыйЭлементПриказ.Поле2 = Направление.Поле2; // Переносим значение поля2
        // Добавляйте другие поля по необходимости
    КонецЦикла;

    // Записываем созданный документ "Приказ"
    НовыйПриказ.Записать();
    
    Сообщить("Приказ успешно создан на основании направлений на пересдачу.");
КонецПроцедуры
